Revit 2024 API
SpecTypeId.RotationalPointSpringCoefficient Property
 Rotational Point Spring Coefficient, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId RotationalPointSpringCoefficient { get; }
Visual Basic
Public Shared ReadOnly Property RotationalPointSpringCoefficient As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RotationalPointSpringCoefficient {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace